Repository: jimregan/citizens-information-raw
Catalog: en-fr/www.citizensinformation.ie/fr/money_and_tax/tax/income_tax/universal_social_charge.html.txt.tmx
Source language: en
Languages: fr

source: This service is now available through Revenue's myAccount Service. You can also contact your local Revenue office for a review of your USC deductions
fr: Si vous devez bénéficier d'un remboursement pour avoir reçu une carte médicale, ce remboursement devra vous être versé immédiatement par votre employeur

source: If you have become unemployed during the year you can reclaim any overpayments of income tax and USC using Revenue's tax repayment Form P50 (pdf)
fr: Si vous n'avez pas occupé un emploi continu dans une entreprise ni reçu de pension au cours de l'année concernée, l'Administration fiscale se chargera du remboursement au terme de l’exercice

source: They will deduct and pay it to Revenue on behalf of employees
fr: Il ne devrait plus y avoir de trop-perçu de Charge Sociale Universelle

source: Revenue will notify employers of the USC rates and thresholds to be applied for all employees
fr: La déduction de la Charge Sociale Universelle des salaires des employés est à la charge des employeurs et des fonds de pension

source: You should inform Revenue of any changes in your circumstances (for example, if you get a medical card)
fr: Vous êtes tenu d’informer l’Administration fiscale de tout changement de situation (par exemple si vous obtenez une carte médicale)
